{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00a5\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape_type": "raw", "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "output_shape": null, "name": "lambda_1", "arguments": {}, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "activation": "elu", "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_1", "border_mode": "valid", "nb_filter": 24, "b_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "nb_col": 5, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "activation": "elu", "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_2", "border_mode": "valid", "nb_filter": 36, "b_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "nb_col": 5, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "activation": "elu", "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_3", "border_mode": "valid", "nb_filter": 48, "b_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "nb_col": 5, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activation": "elu", "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_4", "border_mode": "valid", "nb_filter": 64, "b_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activation": "elu", "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_5", "border_mode": "valid", "nb_filter": 64, "b_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "W_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"output_dim": 1152, "activation": "elu", "b_regularizer": null, "input_dim": 1152, "name": "dense_1", "W_constraint": null, "b_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.6, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"output_dim": 100, "activation": "elu", "b_regularizer": null, "input_dim": 1152, "name": "dense_2", "W_constraint": null, "b_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"output_dim": 50, "activation": "elu", "b_regularizer": null, "input_dim": 100, "name": "dense_3", "W_constraint": null, "b_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"output_dim": 10, "activation": "elu", "b_regularizer": null, "input_dim": 50, "name": "dense_4", "W_constraint": null, "b_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"output_dim": 1, "activation": "elu", "b_regularizer": null, "input_dim": 10, "name": "dense_5", "W_constraint": null, "b_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null}}]}